class FamilyLawStructure:
    def __init__(self):
        self.laws = {
            "Глава 3. Условия и порядок заключения брака": {
                "Статья 10. Заключение брака": {
                    "описание": "",
                    "url": "a2d57f18a83a6bc642bc858b902cd569e3cef0af/"
                },
                "Статья 11. Порядок заключения брака": {
                    "описание": "",
                    "url": "460a84ab74616e740d2581dd3d2140ee1af4b5d8/"
                },
                "Статья 12. Условия заключения брака": {
                    "описание": "",
                    "url": "e816c719b5266ca4f28f9ae0c236ab2e8520f3e2/"
                },
                "Статья 13. Брачный возраст": {
                    "описание": "",
                    "url": "d431b248afe31c49fd597b5beb10122ca74df291/"
                },
                "Статья 14. Обстоятельства, препятствующие заключению брака": {
                    "описание": "",
                    "url": "eff2fdb151dc56cf74a0a70b3dbef1475c08d5c0/"
                },
                "Статья 15. Медицинское обследование лиц, вступающих в брак": {
                    "описание": "",
                    "url": "22aaae75cedae3983eaea614966b169f6a2962b3/"
                }
            },
            "Глава 4. Прекращение брака": {
                "Статья 16. Основания для прекращения брака": {
                    "описание": "",
                    "url": "31fc8a63a7f9d66e183031b20eabb7fd1d2e2ed4/"
                },
                "Статья 17. Ограничение права на предъявление мужем требования о расторжении брака": {
                    "описание": "",
                    "url": "3e67292d095e6a50b136a407b147334376f605a9/"
                },
                "Статья 18. Порядок расторжения брака": {
                    "описание": "",
                    "url": "327e29dd7ffe9dac045ca07e827ac7c122ba219e/"
                },
                "Статья 19. Расторжение брака в органах записи актов гражданского состояния": {
                    "описание": "",
                    "url": "9e43cedf0f660aa107b296ec91b196dbe5836c68/"
                },
                "Статья 20. Рассмотрение споров, возникающих между супругами при расторжении брака в органах записи актов гражданского состояния": {
                    "описание": "",
                    "url": "974960f401f0e5ec69cbd89c18917ea327ff356d/"
                },
                "Статья 21. Расторжение брака в судебном порядке": {
                    "описание": "",
                    "url": "72751553f2dbd0ffeb99df74fd4b0e9a57ac4255/"
                },
                "Статья 22. Расторжение брака в судебном порядке при отсутствии согласия одного из супругов на расторжение брака": {
                    "описание": "",
                    "url": "4a167ba0c30fe37c07642d042cf2aa85ee1345da/"
                },
                "Статья 23. Расторжение брака в судебном порядке при взаимном согласии супругов на расторжение брака": {
                    "описание": "",
                    "url": "196a18abf7a7c183481858f4b2e5369f1935fa8c/"
                },
                "Статья 24. Вопросы, разрешаемые судом при вынесении решения о расторжении брака": {
                    "описание": "",
                    "url": "6867b46a2386f6df69ca76d8133997881e16c84a/"
                },
                "Статья 25. Момент прекращения брака при его расторжении": {
                    "описание": "",
                    "url": "92be360d5ee562a344c8b09d32420ab7e5a5f5d4/"
                },
                "Статья 26. Восстановление брака в случае явки супруга, объявленного умершим или признанного безвестно отсутствующим": {
                    "описание": "",
                    "url": "5730bd2553a5bdecbaaa6c62db82ed309230cd85/"
                }
            },
            "Глава 5. Недействительность брака": {
                "Статья 27. Признание брака недействительным": {
                    "описание": "",
                    "url": "3e932d9fa627a1f69c466067551412491d22ee4e/"
                },
                "Статья 28. Лица, имеющие право требовать признания брака недействительным": {
                    "описание": "",
                    "url": "d924d3ee5e09fa8c6f3d0d8265b05a1e016b9236/"
                },
                "Статья 29. Обстоятельства, устраняющие недействительность брака": {
                    "описание": "",
                    "url": "4e013d7f252aa4ea0ff0047d4270be578912e339/"
                },
                "Статья 30. Последствия признания брака недействительным": {
                    "описание": '''
                    СК РФ Статья 30. Последствия признания брака недействительным

1. Брак, признанный судом недействительным, не порождает прав и обязанностей супругов, предусмотренных настоящим Кодексом, за исключением случаев, установленных пунктами 4 и 5 настоящей статьи.

2. К имуществу, приобретенному совместно лицами, брак которых признан недействительным, применяются положения Гражданского кодекса Российской Федерации о долевой собственности. Брачный договор, заключенный супругами (статьи 40 - 42 настоящего Кодекса), признается недействительным.

3. Признание брака недействительным не влияет на права детей, родившихся в таком браке или в течение трехсот дней со дня признания брака недействительным (пункт 2 статьи 48 настоящего Кодекса).

4. При вынесении решения о признании брака недействительным суд вправе признать за супругом, права которого нарушены заключением такого брака (добросовестным супругом), право на получение от другого супруга содержания в соответствии со статьями 90 и 91 настоящего Кодекса, а в отношении раздела имущества, приобретенного совместно до момента признания брака недействительным, вправе применить положения, установленные статьями 34, 38 и 39 настоящего Кодекса, а также признать действительным брачный договор полностью или частично.

Добросовестный супруг вправе требовать возмещения причиненного ему материального и морального вреда по правилам, предусмотренным гражданским законодательством.

5. Добросовестный супруг вправе при признании брака недействительным сохранить фамилию, избранную им при государственной регистрации заключения брака.
                    ''',
                    "url": "9b1057467d88ad61ee5fa8625f7de767ad96f608/"
                }
            }
        }


    def get_chapters(self):
        return list(self.laws.keys())

    def get_articles_for_chapter(self, chapter_name):
        return list(self.laws[chapter_name].keys())
        
    def get_article_description_and_link(self, chapter_name, article_name):
        article_dict = self.laws[chapter_name][article_name]
        description = article_dict["описание"]
        url = article_dict["url"]
        link = f"https://www.consultant.ru/document/cons_doc_LAW_8982/{url}"
        
        if (len(description) > 500):
            return f'{description[:500]}...', f"\n\n<a href='{link}'>Перейти на статью для дополнительной информации</a>"
        else:
            return description, None